// 1. Дана строка в виде числа. Необходимо просуммировать все элементы числа
// ‘123’ -> 6
// ‘111111111111’ -> 12

// 2. Дан статичный массив элементов. С помощью цикла for найдите произведение
// всех элементов массива

// 3. На вход подается число. Необходимо вывести все числа от 1 до введенного числа
// кратные 3.

// 4. Дан статичный массив с элементами и число вводимое с клавиатуры. С помощью
// цикла for и оператора if проверьте есть ли в массиве введенное число. Если есть,
// то остановите выполнение цикла. Если нет, то найдите среднее арифметическое
// всех чисел

// 5. Найдите максимальное значение в статичном массиве используя цикл.

// 6. Выведите на экран случайное целое число от 1 до 100. (Math.random)

// 7. Преобразуйте первую букву строки в верхний регистр несколькими способами

// 8. Преобразуйте первую букву каждого слова строки в верхний регистр.

// 9. На вход программе подается натуральное число n. Напишите программу, которая
// печатает звездный прямоугольник размерами n×10 несколькими способами.
// 2 -> **********
// **********

// 10. Задача на слово палиндром.

// 11. Задача на анаграмму. На входе 2 строки, необходимо выявить являются ли
// введенные значения анаграммами

// 12. На вход программе подается натуральное число n. Напишите программу, которая
// печатает звездный треугольник.
// 7 -> *******
// ******
// *****
// ****
// ***
// **
// *

// 13. Найдите минимальное значение в массиве используя цикл